Revit 2027 API
FamilyParameter.CanAssignFormula Property
Indicates if this parameter can be assigned a formula.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool CanAssignFormula { get; }
Public ReadOnly Property CanAssignFormula As Boolean
	Get
public:
property bool CanAssignFormula {
	bool get ();
}
member CanAssignFormula : bool with get
Property Value
Boolean
See Also
Reference
FamilyParameter Class
Autodesk.Revit.DB Namespace